<script></script>

<section>
	<div class="intro-text-mobile"><slot /></div>
	<p>
		Это интерактивная инфографика, которая позволяет получить представление о российской внешней
		торговле товарами (без учета услуг, финансовых и других нетоварных операций). Здесь в виде
		графиков показаны суммы импорта и экспорта между Россией и другими странами, а также динамика
		изменения этих значений с 2000 по 2020 годы.
	</p>
	<details>
		<summary><span>Как пользоваться?</span></summary>
		<p>На каждом графике показаны объемы импорта в Россию, экспорта из России, а также совокупный товарооборот для выбранной страны-партнера.
			Значения даны в млрд. долларов США. </p>

		<p>Отображение импорта, экспорта или товарооборота можно контролировать использованием соответствующих меток (флажки "Импорт", "Экспорт", "Оборот").</p>
		<p>Кроме выбора периода времени графиков с 2000 по 2020 гг., с помощью опции "Только период" для отображения можно выбрать только 2 крайние точки временного отрезка.</p>
		<p>Если навести курсор мыши на график, можно увидеть конкретные значения по каждому году (только в десктоп-версии).</p>
		<p>Клик по графику выведет отдельное окно, где будет доступна информация о ТОП-5 категориях товаров, составляющих импорт и экспорт для выбранной страны.</p>

	</details>
	<details>
		<summary><span>Какой источник у данных?</span></summary>
		<p>
			Данные получены с использованием API сайта <a href="https://comtrade.un.org/"
				>UN Comtrade Database</a
			>.
		</p>
		<p>
			Для целей инфографики выбраны только те страны, импорт или экспорт которых с Россией за
			рассматриваемый период времени достигал 0.5% от общероссийского импорта или экспорта в
			какой-либо год.
		</p>
	</details>
</section>

<style>
	section {
		max-width: var(--main-column-width);
		text-align: left;
		margin: 0 auto 1.5rem auto;
		font-size: 1rem;
		line-height: 1.5rem;
		padding: 0 1rem 0 1rem;
	}

	.intro-text-mobile {
		color: var(--color-dark-secondary);
		font-weight: 400;
	}

	details {
		margin-bottom: 1rem;
		padding: 0;
	}

	details p {
		margin: 0.5rem;
	}

	summary {
		padding: 0.2rem 0.5rem;
	}

	summary {
		cursor: pointer;
	}

	summary span {
		background-color: var(--color-dark-50);
		outline: 1px solid var(--color-dark-light);
		padding: 0.1rem 0.3rem;
		border-radius: 1px;
	}
</style>
